app/views/clips/_fave.html.erb

SELECT "streamers".* FROM "streamers"
---
  <%= f.label "Make a favorite" %>
  <%= f.collection_check_boxes :streamer_ids, Streamer.all, :id, :name %>