app/views/clips/_form.html.erb

SELECT "streamers".* FROM "streamers"
---
    <p>Choose a streamer:</p>
      <%= Streamer.all.each do |s| %>