app/views/clips/edit.html.erb

SELECT "streamers".* FROM "streamers" INNER JOIN "clip_streamers" ON "streamers"."id" = "clip_streamers"."streamer_id" WHERE "clip_streamers"."clip_id" = ?  [["clip_id", 8]]
---
  <ul>
    <% @clip.streamers.each do |s| %>

SELECT "streamers".* FROM "streamers"
---
  <%= f.label :streamer %>
    <%= f.collection_select :streamer_id, Streamer.all, :id, :name, include_blank: 'Select One'%>