app/views/clips/index.html.erb

SELECT "clips".* FROM "clips" INNER JOIN "reviews" ON "clips"."id" = "reviews"."clip_id" WHERE "reviews"."user_id" = ?  [["user_id", 23]]
---
    <% if params["filter"] == "Created"%>
    <%= @user.clips.each do |clip| %>