app/views/clips/show.html.erb

<ul>
  <% @clip.streamers.each do |s| %>
---
SELECT "streamers".* FROM "streamers" INNER JOIN "clip_streamers" ON "streamers"."id" = "clip_streamers"."streamer_id" WHERE "clip_streamers"."clip_id" = ?  [["clip_id", 9]]