app/views/clips/show.html.erb

SELECT "streamers".* FROM "streamers" WHERE "streamers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<p>URL to Clip:<%= @clip.url %></p>
<p><% @streamer = Streamer.find(@clip.streamer_id) %></p>