app/views/users/new.html.erb

SELECT "streamers".* FROM "streamers"
---
  <div>
     <% Streamer.all.each do |streamer| %>
     <label>
         <%= check_box_tag "user[streamer_ids][]", streamer.id, f.object.streamers.include?(streamer) %>