app/views/users/show.html.erb

      <div>
        <% @user.clips.each do |c| %>
---
SELECT "clips".* FROM "clips" INNER JOIN "reviews" ON "clips"."id" = "reviews"."clip_id" WHERE "reviews"."user_id" = ?  [["user_id", 1]]

      <div>
        <% StreamerUser.all.each do |su| %>
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "streamer_users".* FROM "streamer_users"

    <div>
      <% @user.reviews.each do |r| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 23]]