app/views/streamers/favorites.html.erb

<h1>Favorite Streamers</h1>
<% Streamer.all.each do |s| %>
---
SELECT "streamers".* FROM "streamers"