app/controllers/clips_controller.rb

  def index
@clips = Clip.all
---
SELECT "clips".* FROM "clips"

  def show
@clip = Clip.find(params[:id])
---
SELECT "clips".* FROM "clips" WHERE "clips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
#render plain: params[:clip].inspect
@clip = current_user.clips.build(clip_params)
#@clip = Clip.new(clip_params)

if(@clip.save)
---
INSERT INTO "clips" ("title", "url", "streamer_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Bob"], ["url", "www.bob.com"], ["streamer_id", 1], ["user_id", 2], ["created_at", "2020-07-08 16:36:06.747793"], ["updated_at", "2020-07-08 16:36:06.747793"]]

  def edit
@clip = Clip.find(params[:id])
---
SELECT "clips".* FROM "clips" WHERE "clips"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def update
@clip = Clip.find(params[:id])
if(@clip.update(clip_params))
---
SELECT "clips".* FROM "clips" WHERE "clips"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "clips" SET "title" = ?, "url" = ?, "updated_at" = ? WHERE "clips"."id" = ?  [["title", "Charlotte2"], ["url", "www.charlotte2.com"], ["updated_at", "2020-07-22 14:36:09.831655"], ["id", 15]]

  def destroy
@clip = Clip.find(params[:id])
@clip.destroy
---
SELECT "clips".* FROM "clips" WHERE "clips"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "clips" WHERE "clips"."id" = ?  [["id", 1]]