app/controllers/reviews_controller.rb

def new
@clip = Clip.find(params[:clip_id])
---
SELECT "clips".* FROM "clips" WHERE "clips"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

  def create

@clip = Clip.find(params[:clip_id])

@review = @clip.reviews.create(review_params)
---
SELECT "clips".* FROM "clips" WHERE "clips"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
INSERT INTO "reviews" ("title", "created_at", "updated_at", "body", "clip_id") VALUES (?, ?, ?, ?, ?)  [["title", "this is a new review"], ["created_at", "2020-07-27 15:33:42.853897"], ["updated_at", "2020-07-27 15:33:42.853897"], ["body", "this is a body"], ["clip_id", 18]]

  def destroy
@clip = Clip.find(params[:clip_id])
@review = @clip.reviews.find(params[:id])
@review.destroy
---
SELECT "clips".* FROM "clips" WHERE "clips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."clip_id" = ? AND "reviews"."id" = ? LIMIT ?  [["clip_id", 31], ["id", 12], ["LIMIT", 1]]
SELECT "clips".* FROM "clips" WHERE "clips"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 12]]

  def show
@clip = Clip.find(params[:id])
---
SELECT "clips".* FROM "clips" WHERE "clips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    if @clip = Clip.find_by_id(params[:clip_id])
---
SELECT "clips".* FROM "clips" WHERE "clips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]