app/controllers/sessions_controller.rb

  def create

    if auth_hash = request.env["omniauth.auth"]

      oauth_email = request.env["omniauth.auth"]["info"]["email"]
      oauth_name = request.env["omniauth.auth"]["info"]["nickname"]

      if user = User.find_by(:email => oauth_email)
        session[:user_id] = user.id
        redirect_to '/'
      else
        user = User.new(:username => oauth_name, :email => oauth_email, :password => SecureRandom.hex)
        if user.save
          session[:user_id] = user.id
          redirect_to user_path(user.id)
        else raise user.errors.full_messages.inspect
        end
      end
    else
      user = User.find_by(:email => params["user"]["email"])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "scottjordanswimming@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "scott@gmail.com"], ["LIMIT", 1]]