app/controllers/sessions_controller.rb

      def create
      #  binding.pry
        if @user = User.find_by(username: params[:user][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Ben"], ["LIMIT", 1]]