app/models/clip.rb

def streamers_attributes=(streamers_hashes)
  # {"0"=>{"name"=>"this is the box"}}
streamers_hashes.each do |i, streamer_attributes|

streamer = Streamer.find_or_create_by(name: streamer_attributes[:name])
---
INSERT INTO "streamers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Charlotte"], ["created_at", "2020-07-22 14:35:24.342260"], ["updated_at", "2020-07-22 14:35:24.342260"]]
SELECT "streamers".* FROM "streamers" WHERE "streamers"."name" = ? LIMIT ?  [["name", "Charlotte"], ["LIMIT", 1]]