app/views/reviews/_reviews.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."clip_id" = ?  [["clip_id", 2]]
---
<h3>Reviews</h3>
<% @clip.reviews.each do |review| %>